// Ви живете в місті Картезія, де всі дороги прокладені в ідеальну сітку. Ви приїхали на десять хвилин занадто
// рано до зустрічі, тому вирішили скористатися можливістю піти на невелику прогулянку. Місто надає своїм мешканцям
// програму для створення прогулянок на своїх телефонах - кожен раз, коли ви натискаєте кнопку, вона надсилає вам масив
// однобуквенних рядків, що представляють вказівки до прогулянки (наприклад, ['n', 's', 'w', "e"]).
//     Ви завжди ходите лише по одному блоку для кожної літери (напрямку), і ви знаєте, що вам потрібно одна хвилина,
//     щоб пройти один міський блок, тому створіть функцію, яка поверне істину, якщо прогулянка, яку надає вам додаток,
//     займе у вас рівно десять хвилин (ви не хочете бути рано чи пізно!) і, звичайно, поверне вас до початкової точки.
//     Повернути false в іншому випадку.